var message; // a-z, A-Z, 0-9, $, _ название нельзя начинать с цифры, имена переменных чуствительны к регистру

var myMessage;
myMessage ='Сообщение';
var myNumber = 10; // мы може наполнять переменные числами, числами с точкой, отрицальетльными числами

var myString = 'Здоров Иван'; // мы можем поместить в переменную строку, это заключенный в кавычки текст или пустая строка без контента, число в кавычках будет воспринято как строка

var myBoolean = true; // булиан тип это логический тип данных true или false

var myNull = null; //у переменной присвоено значение но оно равняеться ничему

var myUndefined = undefined; // значение у переменно     вообще отсутствет

// мы изучили 5 типов данных которые принято называть примитивными типами данных

var myObject ={    //это обект - 6 тип даннх который представляет из себя некую солянку их всех типов данных
    name:'Ivan',
    age: 35
};